# Title and page header
TITLE = Gestionnaire de t&eacute;l&eacute;chargement
DOWNLOAD_LINK = /fr/telecharger/
CAOM_PACKAGE_ENDPOINT = /fr/telecharger/package
PAGE_HEADER = Choisissez une des m&eacute;thodes de t&eacute;l&eacute;chargement suivantes:
DATE_MODIFIED_LABEL = Date de modification

# Buttons
URL_LIST_BUTTON = List d'URLs dans un fichier
HTML_LIST_BUTTON = List d'URLs sur une page WEB
SHELL_SCRIPT_BUTTON = Acc&egrave;s au script shell
TAR_PACKAGE_BUTTON = Fichier TAR
ZIP_PACKAGE_BUTTON = Fichier ZIP

# Download type descriptions
JAVA_WEB_START_DESCRIPTION = Le gestionnaire de t&eacute;l&eacute;chargement est lanc&eacute; comme une \
application de bureau via Java Webstart. Le logiciel est alors automatiquement mis en \
cache sur votre ordinateur, de sorte que les d&eacute;marrages subs&eacute;quants sont plus rapides.

TAR_PACKAGE_DESCRIPTION = Obtenez un fichier TAR (extension .tar).

ZIP_PACKAGE_DESCRIPTION = Obtenez un fichier ZIP (extension .zip).

SHELL_SCRIPT_DESCRIPTION = Obtenez un script Bash ex&eacute;cutable en ligne de commande. Destin&eacute; aux utilisateurs &aacute; l'aise \
avec la ligne de commande. Un jeton d'autorisation int&eacute;gr&eacute; dans le script pour propager l'authentification initiale \
sera disponible pour les utilisateurs connect&eacute;s. Ce jeton expirera après un certain d&eacute;lai d&eacute;s le t&eacute;l&eacute;chargement. \
<br /><br /> \
<code>$ . ./cadc-download-xxxx.sh</code>

URL_LIST_DESCRIPTION = Un fichier texte contenant une liste d'URLs est t&eacute;l&eacute;charg&eacute;. Ce fichier peut par la suite &ecirc;tre \
utilis&eacute; avec un script ou directement avec la commande wget. Chaque ligne contient une \
URL ou, lorsque la g&eacute;n&eacute;ration de l'URL &eacute;choue, un message d'erreur. \
<br/><br /> \
La commande wget pour t&eacute;l&eacute;charger tous les fichiers correspondants aux URLs du fichier t&eacute;l&eacute;charg&eacute; est la suivante: \
<br/> \
<code>% wget --content-disposition -i NOM_DE_FICHIER </code> \
<br/><br /> \
Noter que seulement les fichiers publiques sont disponibles si cette option est s&eacute;lectionn&eacute;e.
Voir ci-dessous pour plus d'options possibles pour la commande wget: \
<br/><br /> \
Noter que seulement les fichiers publiques sont disponibles via cette option. \
<br/> \
Voir ci-dessous pour plus d'options <i>wget</i>.

HTML_LIST_DESCRIPTION = Permet de visualiser la liste des URLs (une par fichier) dans \
une page Web et de s&eacute;lectionner individuellement les fichiers &agrave; t&eacute;l&eacute;charger.

# Remember download method
REMEMBER_CHECKBOX_LABEL = Retenir mon choix de m&eacute;thode de t&eacute;l&eacute;chargement
REMEMBER_CHECKBOX_TEXT = (cookies requis)
REMEMBER_TEXT = Chaque page de t&eacute;l&eacute;chargement poss&egrave;de un bouton \"Choisissez l'une des \
autres m&eacute;thodes de t&eacute;l&eacute;chargement\" qui, lorsque s&eacute;lectionn&eacute;, supprime le choix de \
t&eacute;l&eacute;chargement retenu et retourne vers cette page &agrave; choix multiples.

# Help
HELP_HEADER = Aide

HELP_WGET_NOT_WORKING_HEADER = ne fonctionne pas
HELP_WGET_NOT_WORKING_TEXT = \
<p> \
    L'utilisation recommand&eacute;e ci-dessus comprend l&rsquo;option \
    <code>--content-disposition</code>, disponible dans les version 1.12 ou ult&eacute;rieure \
    de <i>wget</i>. Cette option am&eacute;liore la probabilit&eacute; que les fichiers enregistr&eacute;s \
    le seront avec les noms de fichiers corrects. \
</p> \
<p> \
    Veuillez noter qu'il existe de nombreuses versions de <i>wget</i> avec une vari&eacute;t&eacute; \
    d'options et de syntaxe. S'il vous pla&icirc;t consulter vos pages d'aide locaux. \
    &nbsp;<code>wget --help</code> devrait afficher les options de votre version de \
    <i>wget</i>. \
</p> \
<p> \
    La commande <i>wget</i> devrait &ecirc;tre disponible sur la plupart des syst&egrave;mes. \
    Sinon, <i>wget</i> peut &ecirc;tre t&eacute;l&eacute;charg&eacute; &agrave; partir de \
    <a href=\"http://www.gnu.org/software/wget/\">gnu.org</a>. \
    Alternativement, vous pouvez essayer l'un des nombreux autres services de \
    t&eacute;l&eacute;chargement tels que: curl, HTTrack, sangsue (Mozilla Add-on), pavuk, lftp, etc. \
</p>

HELP_WGET_OPTIONS_HEADER = les options couramment utilis&eacute;es avec
HELP_WGET_OPTIONS_TEXT = \
<p> \
		Pour t&eacute;l&eacute;charger un grand nombre de fichiers avec <i>wget</i>, les options \
		suivantes pourraient &ecirc;tre utiles: \
</p> \
<ul> \
   <li><code>-t,  --tries=NOMBRE</code> d&eacute;finir le nombre de tentatives &agrave; NOMBRE (5 recommand&eacute;). \
   														</li> \
   <li><code>--auth-no-challenge</code>	envoyer des informations d'authentification Basic HTTP \
   														sans attendre l&rsquo;interrogation du serveur, &eacute;conomisant \
   														ainsi un aller-retour.</li> \
   <li><code>--waitretry=SECONDS</code> attendre 1 &agrave; SECONDES entre les tentatives d'une \
   														r&eacute;cup&eacute;ration. Par d&eacute;faut, wget prendra une valeur de \
   														10 secondes.</li> \
   <li><code>-N,  --timestamping</code> Activez l&rsquo;horodatage et t&eacute;l&eacute;chargez uniquement les \
   														fichiers manquants ou mises &agrave; jour.</li> \
</ul>
